src/cf/Catalogs/уатВидыОбслуживанияТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>уатВидыОбслуживанияТС</Name>
			<Comment>Виды обслуживания ТС (уат)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОбслуживанияТС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатВидыОбслуживания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВПланированииТО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветВидаОбслуживания</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступенДляВыбораВМобильномПриложении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Циклический</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОтражаетсяВУчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗамещаемыеРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗамещаемыйВидОбслуживанияТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатВидыОбслуживанияТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатРаботыПоРемонту</v8:Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/уатСервиснаяКнижка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатСервиснаяКнижка</Name>
			<Comment>(уат)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Привязана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>МодельТС</Name>
					<Comment>Модель ТС.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатМоделиТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатВидыОбслуживанияТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатРаботыПоРемонту</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/уатВидыОбслуживания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатВидыОбслуживания</Name>
			<Comment>(уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВводВЭксплуатацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееПеремещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дооборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Достройка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КапитальныйРемонт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Модернизация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеАмортизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Передача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переоценка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодготовкаКПередаче</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятиеКУчету</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятиеКУчетуСВводомВЭксплуатацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочие состояния (пользовательские)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реконструкция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СреднийРемонт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТекущийРемонт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Техобслуживание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастичнаяЛиквидация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/уатВидыОбслуживанияТС/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатСправочникФормаЭлементаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, Объект, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;

	ТекущийЦвет = РеквизитФормыВЗначение("Объект").ЦветВидаОбслуживания.Получить();
	ЦветВидаОбслуживания = ТекущийЦвет;	
	
	Элементы.ВидОбслуживанияТС.СписокВыбора.Очистить();
	Элементы.ВидОбслуживанияТС.СписокВыбора.Добавить(
		ПредопределенноеЗначение("Перечисление.уатВидыОбслуживания.ТекущийРемонт")    , НСтр("en='Running repair';ru='Текущий ремонт'"));
	Элементы.ВидОбслуживанияТС.СписокВыбора.Добавить(
		ПредопределенноеЗначение("Перечисление.уатВидыОбслуживания.Техобслуживание")  , НСтр("ru = 'Техобслуживание'; en = 'Maintenance'"));
	Элементы.ВидОбслуживанияТС.СписокВыбора.Добавить(
		ПредопределенноеЗначение("Перечисление.уатВидыОбслуживания.СреднийРемонт")    , НСтр("en='Medium repair';ru='Средний ремонт'"));
	Элементы.ВидОбслуживанияТС.СписокВыбора.Добавить(
		ПредопределенноеЗначение("Перечисление.уатВидыОбслуживания.КапитальныйРемонт"), НСтр("en='Overhaul';ru='Капитальный ремонт'"));
	Элементы.ВидОбслуживанияТС.СписокВыбора.Добавить(
		ПредопределенноеЗначение("Перечисление.уатВидыОбслуживания.Дооборудование")   , НСтр("en='AdditionalEquipment';ru='Дооборудование'"));
	Элементы.ВидОбслуживанияТС.СписокВыбора.Добавить(
		ПредопределенноеЗначение("Перечисление.уатВидыОбслуживания.Модернизация")     , НСтр("en='Renovation';ru='Модернизация'"));
	
	Элементы.ДоступенДляВыбораВМобильномПриложении.Видимость = НЕ уатОбщегоНазначенияПовтИсп.ВариантПоставкиСТД();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	уатЗащищенныеФункцииКлиент.уатСправочникФормаЭлементаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ЦветВидаОбслуживания = Новый ХранилищеЗначения(ЦветВидаОбслуживания,Новый СжатиеДанных(9));
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ТекущийЦвет = ТекущийОбъект.ЦветВидаОбслуживания.Получить();
	ЦветВидаОбслуживания = ТекущийЦвет;
	
	УстановитьОтборыДинамическихСписков();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УстановитьОтборыДинамическихСписков();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ЗамещаемыеРаботы

&НаКлиенте
Процедура ЗамещаемыеРаботыПриАктивизацииСтроки(Элемент)
	ОбновитьСписокВыбораЗамещаемойНоменклатуры();
КонецПроцедуры

&НаКлиенте
Процедура ЗамещаемыеРаботыЗамещаемыйВидОбслуживанияТСПриИзменении(Элемент)
	ОбновитьСписокВыбораЗамещаемойНоменклатуры();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОчиститьЗамещаемыеРаботы(Команда)
	Если Объект.ЗамещаемыеРаботы.Количество() > 0 Тогда
		ТекстНСТР = НСтр("en='Replaced jobs will be cleared. Continue?';ru='Будет выполнена очистка состава замещаемых работ и запчастей. Продолжить?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("ОчиститьЗамещаемыеРаботыЗавершение", ЭтотОбъект),
			ТекстНСТР, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоВидуОбслуживания(Команда)
	
	Форма = ПолучитьФорму("Справочник.уатВидыОбслуживанияТС.ФормаВыбора",, ЭтотОбъект);
	Форма.ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ЗаполнитьПоВидуОбслуживанияЗавершение", ЭтотОбъект);
	ЭлементОтбора                     = Форма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение       = Новый ПолеКомпоновкиДанных("Ссылка");
	ЭлементОтбора.ВидСравнения        = ВидСравненияКомпоновкиДанных.НеРавно;
	ЭлементОтбора.ПравоеЗначение      = Объект.Ссылка;
	ЭлементОтбора.РежимОтображения    = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементОтбора.Использование       = Истина;
	
	Форма.Открыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОчиститьЗамещаемыеРаботыЗавершение(Результат, ДопПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.ЗамещаемыеРаботы.Очистить();
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция НоменклатураВидаОбслуживания(ВидОбслуживания)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	уатСервиснаяКнижка.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(уатСервиснаяКнижка.Номенклатура) = ТИП(Справочник.уатВидыОбслуживанияТС)
	|			ТОГДА 2
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ПорядокНоменклатуры
	|ИЗ
	|	РегистрСведений.уатСервиснаяКнижка КАК уатСервиснаяКнижка
	|ГДЕ
	|	уатСервиснаяКнижка.ТО = &ТО
	|
	|СГРУППИРОВАТЬ ПО
	|	уатСервиснаяКнижка.Номенклатура,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(уатСервиснаяКнижка.Номенклатура) = ТИП(Справочник.уатВидыОбслуживанияТС)
	|			ТОГДА 2
	|		ИНАЧЕ 1
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядокНоменклатуры";
	Запрос.УстановитьПараметр("ТО", ВидОбслуживания);
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Номенклатура");
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПоВидуОбслуживанияЗавершение(Результат, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат)
		И ТипЗнч(Результат) = Тип("СправочникСсылка.уатВидыОбслуживанияТС") Тогда
		
		НоменклатураВидаОбслуживания = НоменклатураВидаОбслуживания(Результат);
		Если НоменклатураВидаОбслуживания.Количество() = 0 Тогда
			ТекстНСтр = НСтр("ru = 'Для выбранного вида обслуживания в сервисной книжке не найдены работы и запчасти'; en = 'No work or spare parts were found in the service book for the selected type of service.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстНСтр);
		Иначе
			ДобавленоСтрок = 0;
			Для Каждого ТекНоменклатура Из НоменклатураВидаОбслуживания Цикл
				СтруктураОтбора = Новый Структура("ЗамещаемыйВидОбслуживанияТС, Номенклатура", Результат, ТекНоменклатура);
				НайденныеСтроки = Объект.ЗамещаемыеРаботы.НайтиСтроки(СтруктураОтбора);
				Если НайденныеСтроки.Количество() = 0 Тогда
					ДобавленоСтрок = ДобавленоСтрок + 1;
					НоваяСтрока = Объект.ЗамещаемыеРаботы.Добавить();
					НоваяСтрока.ЗамещаемыйВидОбслуживанияТС = Результат;
					НоваяСтрока.Номенклатура = ТекНоменклатура;
				КонецЕсли;
			КонецЦикла;
			Если ДобавленоСтрок = 0 Тогда
				ТекстНСтр = НСтр("ru = 'По выбранному виду обслуживания уже заполнены все работы и запчасти'; en = 'All work and spare parts for the selected type of service have already been filled in'");
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстНСтр);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокВыбораЗамещаемойНоменклатуры()
	
	Элементы.ЗамещаемыеРаботыНоменклатура.СписокВыбора.Очистить();
	
	ТекущиеДанные = Элементы.ЗамещаемыеРаботы.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		НоменклатураВидаОбслуживания = НоменклатураВидаОбслуживания(ТекущиеДанные.ЗамещаемыйВидОбслуживанияТС);
		Для Каждого ТекНоменклатура Из НоменклатураВидаОбслуживания Цикл
			Элементы.ЗамещаемыеРаботыНоменклатура.СписокВыбора.Добавить(ТекНоменклатура);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборыДинамическихСписков()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		СервиснаяКнижкаРаботы,
		"ТО",
		Объект.Ссылка,
		ВидСравненияКомпоновкиДанных.Равно,,
		Истина,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		СервиснаяКнижкаЗапчасти,
		"ТО",
		Объект.Ссылка,
		ВидСравненияКомпоновкиДанных.Равно,,
		Истина,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
КонецПроцедуры

#КонецОбласти
